RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_pxp.c
    /*
     * By default, PXP process block is 8x8. For better performance, choose
     * width and height dividable by block size.
     */
    if (size < 8U * 512U)
    {
        height     = 8U;
        pitchBytes = (uint16_t)(size / height);
    }
    else
    {
        pitchBytes = 512U;
        height     = size / pitchBytes;
    }

    if (height > PXP_MAX_HEIGHT)
    {
        return kStatus_InvalidArgument;
    }

    PXP_StartRectCopy(base, srcAddr, pitchBytes, destAddr, pitchBytes, pitchBytes / 4U, (uint16_t)height,
                      kPXP_AsPixelFormatARGB8888);

    return kStatus_Success;
}

/*!
 * brief Copy continous memory.
 *
 * param base PXP peripheral base address.
 * retval kStatus_Success Successfully started the copy process.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t PXP_MemCopy(PXP_Type *base, uint32_t srcAddr, uint32_t destAddr, uint32_t size)
{
    uint16_t pitchBytes;
    uint32_t height;
    uint32_t unalignedSize;

    if (0U == size)
    {
        return kStatus_InvalidArgument;
    }

    /* For 512 not aligned part, copy by CPU. */
    unalignedSize = size % 512U;

    if (0UL != unalignedSize)
    {
        (void)memcpy((uint8_t *)destAddr, (uint8_t *)srcAddr, unalignedSize);

        destAddr += unalignedSize;
        srcAddr += unalignedSize;
        size -= unalignedSize;
    }

    if (0UL != size)
    {
        /*
         * By default, PXP process block is 8x8. For better performance, choose
         * width and height dividable by block size.
         */
        if (size < 8U * 512U)
        {
            height     = 8U;
            pitchBytes = (uint16_t)(size / height);
        }
        else
        {
            pitchBytes = 512U;
            height     = size / pitchBytes;
        }

        if (height > PXP_MAX_HEIGHT)
        {
            return kStatus_InvalidArgument;
        }

        PXP_StartRectCopy(base, srcAddr, pitchBytes, destAddr, pitchBytes, pitchBytes / 4U, (uint16_t)height,
                          kPXP_AsPixelFormatARGB8888);

        while (0UL == ((uint32_t)kPXP_CompleteFlag & PXP_GetStatusFlags(base)))
        {
        }

        PXP_ClearStatusFlags(base, (uint32_t)kPXP_CompleteFlag);
    }

    return kStatus_Success;
}

#if defined(FSL_FEATURE_PXP_V3) && FSL_FEATURE_PXP_V3

/*!
 * brief Configures one channle of some block's fetch engine.
 *
 * Fetch engine is 64-bit input and 32-bit output per channel
 *
 * param base PXP peripheral base address.
 * param name which block the fetch engine belongs to.
 * param channel channel number.
 * param config pointer to the configuration structure.
 * retval kStatus_Success Successfully configured the engine.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t PXP_SetFetchEngineConfig(PXP_Type *base,
                                  pxp_fetch_engine_name_t name,
                                  uint8_t channel,
                                  const pxp_fetch_engine_config_t *config)
{
    assert(NULL != config);

    /* Check fetch address */
    if ((config->inputBaseAddr0 == 0U) ||
        ((config->inputBaseAddr1 == 0U) && (config->pixelFormat == kPXP_FetchFormatYUV422_2P)))
    {
        return kStatus_InvalidArgument;
    }
    /* Must enable expand when input pixel format is YUV422_2P, to combine Y and UV buffer to one output. */
    if ((config->expandEnable == false) && (config->pixelFormat == kPXP_FetchFormatYUV422_2P))
    {
        return kStatus_InvalidArgument;
    }
    /* Must enable block if flip or rotation is enabled. */
    if ((config->fetchFormat.enableblock == false) &&
        ((config->flipMode != kPXP_FlipDisable) || (config->rotateDegree != kPXP_Rotate0)))
    {
        return kStatus_InvalidArgument;
    }
    /* Block mode cannot work in 64-bit mode */
    if ((config->fetchFormat.enableblock == true) && (config->activeBits == kPXP_Active64Bits))
    {
        return kStatus_InvalidArgument;
    }

    uint32_t ctrlReg        = 0U;
    uint32_t ulcReg         = 0U;
    uint32_t lrcReg         = 0U;
    uint32_t fetchSizeReg   = 0U;
    uint32_t shiftCtrlReg   = 0U;
    uint32_t shiftOffsetReg = 0U;
    uint32_t shiftWidthReg  = 0U;
    uint8_t scanlineNum     = 0U;

    /* When block disabled, handshake scanline mode can only use 1 line mode where scanlineNum = 0. */
    if (config->fetchFormat.enableblock)
    {
        /*  */
        if (config->fetchFormat.blockSize16)
        {
            scanlineNum = 2;
        }
        else
        {
            scanlineNum = 1;
        }
    }

    ctrlReg = PXP_INPUT_FETCH_CTRL_CH0_HANDSHAKE_SCAN_LINE_NUM((uint32_t)scanlineNum) |
              PXP_INPUT_FETCH_CTRL_CH0_RD_NUM_BYTES(config->fetchFormat.burstLength) |
              PXP_INPUT_FETCH_CTRL_CH0_ROTATION_ANGLE((uint32_t)config->rotateDegree) |
              ((uint32_t)config->flipMode << PXP_INPUT_FETCH_CTRL_CH0_HFLIP_SHIFT) |
              PXP_INPUT_FETCH_CTRL_CH0_HIGH_BYTE((uint32_t)config->wordOrder) |
              ((uint32_t)config->interface << PXP_INPUT_FETCH_CTRL_CH0_HANDSHAKE_EN_SHIFT) |
              PXP_INPUT_FETCH_CTRL_CH0_BLOCK_EN((uint32_t)config->fetchFormat.enableblock) |
              PXP_INPUT_FETCH_CTRL_CH0_BLOCK_16((uint32_t)config->fetchFormat.blockSize16) |
              PXP_INPUT_FETCH_CTRL_CH0_CH_EN((uint32_t)config->channelEnable);
    ulcReg       = (((uint32_t)config->ulcY) << 16U) | (uint32_t)config->ulcX;
    lrcReg       = (((uint32_t)config->lrcY) << 16U) | (uint32_t)config->lrcX;
    fetchSizeReg = (((uint32_t)config->totalHeight) << 16U) | ((uint32_t)config->totalWidth);
    shiftCtrlReg = PXP_INPUT_FETCH_SHIFT_CTRL_CH0_INPUT_ACTIVE_BPP((uint32_t)config->activeBits) |
                   PXP_INPUT_FETCH_SHIFT_CTRL_CH0_EXPAND_FORMAT((uint32_t)config->pixelFormat) |
                   PXP_INPUT_FETCH_SHIFT_CTRL_CH0_EXPAND_EN((uint32_t)config->expandEnable) |
                   PXP_INPUT_FETCH_SHIFT_CTRL_CH0_SHIFT_BYPASS((uint32_t)config->shiftConfig.shiftBypass);
    if (!config->shiftConfig.shiftBypass)
    {
        shiftOffsetReg = (uint32_t)config->shiftConfig.component0.offset |
                         ((uint32_t)(config->shiftConfig.component1.offset) << 8U) |
                         ((uint32_t)(config->shiftConfig.component2.offset) << 16U) |
                         ((uint32_t)(config->shiftConfig.component3.offset) << 24U);
        shiftWidthReg = (uint32_t)config->shiftConfig.component0.width |
                        ((uint32_t)(config->shiftConfig.component1.width) << 4U) |
                        ((uint32_t)(config->shiftConfig.component2.width) << 8U) |
                        ((uint32_t)(config->shiftConfig.component3.width) << 12U);
    }

    if (name == kPXP_FetchInput)
    {
        switch (channel)
        {
            case 0:
                base->INPUT_FETCH_CTRL_CH0            = ctrlReg;
                base->INPUT_FETCH_ACTIVE_SIZE_ULC_CH0 = ulcReg;
                base->INPUT_FETCH_ACTIVE_SIZE_LRC_CH0 = lrcReg;
                base->INPUT_FETCH_SIZE_CH0            = fetchSizeReg;
                base->INPUT_FETCH_PITCH = (base->INPUT_FETCH_PITCH & PXP_INPUT_FETCH_PITCH_CH1_INPUT_PITCH_MASK) |
                                          (uint32_t)config->pitchBytes;
                base->INPUT_FETCH_SHIFT_CTRL_CH0 = shiftCtrlReg;
                base->INPUT_FETCH_ADDR_0_CH0     = config->inputBaseAddr0;
                base->INPUT_FETCH_ADDR_1_CH0     = config->inputBaseAddr1;
                if (!config->shiftConfig.shiftBypass)
                {
                    base->INPUT_FETCH_SHIFT_OFFSET_CH0 = shiftOffsetReg;
                    base->INPUT_FETCH_SHIFT_WIDTH_CH0  = shiftWidthReg;
                }
                break;

            case 1:
                base->INPUT_FETCH_CTRL_CH1            = ctrlReg;
                base->INPUT_FETCH_ACTIVE_SIZE_ULC_CH1 = ulcReg;
                base->INPUT_FETCH_ACTIVE_SIZE_LRC_CH1 = lrcReg;
                base->INPUT_FETCH_SIZE_CH1            = fetchSizeReg;
                base->INPUT_FETCH_PITCH = (base->INPUT_FETCH_PITCH & PXP_INPUT_FETCH_PITCH_CH0_INPUT_PITCH_MASK) |
                                          ((uint32_t)config->pitchBytes << 16U);
                base->INPUT_FETCH_SHIFT_CTRL_CH1 = shiftCtrlReg;
                base->INPUT_FETCH_ADDR_0_CH1     = config->inputBaseAddr0;
                base->INPUT_FETCH_ADDR_1_CH1     = config->inputBaseAddr1;
                if (!config->shiftConfig.shiftBypass)
                {
                    base->INPUT_FETCH_SHIFT_OFFSET_CH1 = shiftOffsetReg;
                    base->INPUT_FETCH_SHIFT_WIDTH_CH1  = shiftWidthReg;
                }
                break;

            default:
                /* Only 2 channels are supported per fetch engine. */
                assert(false);
                break;
        }
    }
    else
    {
        switch (channel)
        {
            case 0:
                base->DITHER_FETCH_CTRL_CH0            = ctrlReg;
                base->DITHER_FETCH_ACTIVE_SIZE_ULC_CH0 = ulcReg;
                base->DITHER_FETCH_ACTIVE_SIZE_LRC_CH0 = lrcReg;
                base->DITHER_FETCH_SIZE_CH0            = fetchSizeReg;
                base->DITHER_FETCH_PITCH = (base->INPUT_FETCH_PITCH & PXP_INPUT_FETCH_PITCH_CH1_INPUT_PITCH_MASK) |
                                           (uint32_t)config->pitchBytes;
                base->DITHER_FETCH_SHIFT_CTRL_CH0 = shiftCtrlReg;
                base->DITHER_FETCH_ADDR_0_CH0     = config->inputBaseAddr0;
                base->DITHER_FETCH_ADDR_1_CH0     = config->inputBaseAddr1;
                if (!config->shiftConfig.shiftBypass)
                {
                    base->DITHER_FETCH_SHIFT_OFFSET_CH0 = shiftOffsetReg;
                    base->DITHER_FETCH_SHIFT_WIDTH_CH0  = shiftWidthReg;
                }
                break;

            case 1:
                base->DITHER_FETCH_CTRL_CH1            = ctrlReg;
                base->DITHER_FETCH_ACTIVE_SIZE_ULC_CH1 = ulcReg;
                base->DITHER_FETCH_ACTIVE_SIZE_LRC_CH1 = lrcReg;
                base->DITHER_FETCH_SIZE_CH1            = fetchSizeReg;
                base->DITHER_FETCH_PITCH = (base->INPUT_FETCH_PITCH & PXP_INPUT_FETCH_PITCH_CH0_INPUT_PITCH_MASK) |
                                           ((uint32_t)config->pitchBytes << 16U);
                base->DITHER_FETCH_SHIFT_CTRL_CH1 = shiftCtrlReg;
                base->DITHER_FETCH_ADDR_0_CH1     = config->inputBaseAddr0;
                base->DITHER_FETCH_ADDR_1_CH1     = config->inputBaseAddr1;
                if (!config->shiftConfig.shiftBypass)
                {
                    base->DITHER_FETCH_SHIFT_OFFSET_CH1 = shiftOffsetReg;
                    base->DITHER_FETCH_SHIFT_WIDTH_CH1  = shiftWidthReg;
                }
                break;

            default:
                /* Only 2 channels are supported per fetch engine. */
                assert(false);
                break;
        }
    }
    return kStatus_Success;
}

/*!
 * brief Configures one channel of some block's store engine.
 *
 * Store engine is 32-bit input and 64-bit output per channel.
 * note: If there is only one channel used for data input, channel 0 must be used rather than channel 1.
 *
 * param base PXP peripheral base address.
 * param name the store engine belongs to which block.
 * param channel channel number.
 * param config pointer to the configuration structure.
 * retval kStatus_Success Successfully configured the engine.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t PXP_SetStoreEngineConfig(PXP_Type *base,
                                  pxp_store_engine_name_t name,
                                  uint8_t channel,
                                  const pxp_store_engine_config_t *config)
{
    assert(NULL != config);
    /* Can only choose one plane for YUV422_2p for one channel output */
    if ((uint32_t)config->yuvMode == 0x3U)
    {
        return kStatus_InvalidArgument;
    }

    /* Block mode cannot work in 64-bit mode or YUV422_2p mode */
    if ((config->storeFormat.enableblock == true) &&
        ((config->activeBits == kPXP_Active64Bits) || (config->yuvMode != kPXP_StoreYUVDisable)))
    {
        return kStatus_InvalidArgument;
    }

    /* When block mode is disabled the interface array size can only be 1. TODO. The availiable fetch engine now are
       only input&fetch that can only use handshake 1x1, no need to check */
    // if ((config->storeFormat.enableblock == false) && (config->arraySize != kPXP_StoreHandshake1x1))
    // {
    //     return kStatus_InvalidArgument;
    // }

    uint32_t ctrlReg               = 0U;
    uint32_t shiftCtrlReg          = 0U;
    uint32_t sizeReg               = 0U;
    uint32_t dataShiftMaskRegAddr  = 0U;
    uint32_t dataShiftWidthRegAddr = 0U;
    uint32_t flagShiftMaskRegAddr  = 0U;
    uint32_t flagShiftWidthRegAddr = 0U;

    ctrlReg = PXP_INPUT_STORE_CTRL_CH0_WR_NUM_BYTES((uint32_t)config->storeFormat.burstLength) |
              PXP_INPUT_STORE_CTRL_CH0_FILL_DATA_EN((uint32_t)config->useFixedData) |
              PXP_INPUT_STORE_CTRL_CH0_PACK_IN_SEL((uint32_t)config->packInSelect) |
              ((uint32_t)config->interface << PXP_INPUT_STORE_CTRL_CH0_HANDSHAKE_EN_SHIFT) |
              // PXP_INPUT_STORE_CTRL_CH0_ARRAY_LINE_NUM((uint32_t)config->arraySize) |
              PXP_INPUT_STORE_CTRL_CH0_ARRAY_LINE_NUM(0U) |
              PXP_INPUT_STORE_CTRL_CH0_BLOCK_16((uint32_t)config->storeFormat.enableblock) |
              PXP_INPUT_STORE_CTRL_CH0_BLOCK_EN((uint32_t)config->storeFormat.blockSize16) |
              PXP_INPUT_STORE_CTRL_CH0_CH_EN((uint32_t)config->channelEnable);
    shiftCtrlReg = PXP_INPUT_STORE_SHIFT_CTRL_CH0_SHIFT_BYPASS((uint32_t)config->shiftConfig.shiftBypass) |
                   ((uint32_t)config->yuvMode << PXP_INPUT_STORE_SHIFT_CTRL_CH0_OUT_YUV422_1P_EN_SHIFT) |
                   PXP_INPUT_STORE_SHIFT_CTRL_CH0_OUTPUT_ACTIVE_BPP((uint32_t)config->activeBits);
    sizeReg = (((uint32_t)config->totalHeight) << 16U) | ((uint32_t)config->totalWidth);

    if (name == kPXP_StoreInput)
    {
        switch (channel)
        {
            case 0:
                base->INPUT_STORE_CTRL_CH0 = ctrlReg;
                base->INPUT_STORE_SIZE_CH0 = sizeReg;
                base->INPUT_STORE_PITCH    = (base->INPUT_STORE_PITCH & PXP_INPUT_STORE_PITCH_CH0_OUT_PITCH_MASK) |
                                          (uint32_t)(config->pitchBytes);
                base->INPUT_STORE_SHIFT_CTRL_CH0 = shiftCtrlReg;
                base->INPUT_STORE_ADDR_0_CH0     = config->outputBaseAddr0;
                base->INPUT_STORE_ADDR_1_CH0     = config->outputBaseAddr1;
                base->INPUT_STORE_FILL_DATA_CH0  = config->fixedData;
                dataShiftMaskRegAddr             = (uint32_t) & (base->INPUT_STORE_D_MASK0_H_CH0);
                dataShiftWidthRegAddr            = (uint32_t) & (base->INPUT_STORE_D_SHIFT_L_CH0);
                flagShiftMaskRegAddr             = (uint32_t) & (base->INPUT_STORE_F_MASK_L_CH0);
                flagShiftWidthRegAddr            = (uint32_t) & (base->INPUT_STORE_F_SHIFT_L_CH0);
                break;

            case 1:
                base->INPUT_STORE_CTRL_CH1 = ctrlReg;
                base->INPUT_STORE_SIZE_CH1 = sizeReg;
                base->INPUT_STORE_PITCH    = (base->INPUT_STORE_PITCH & PXP_INPUT_STORE_PITCH_CH0_OUT_PITCH_MASK) |
                                          ((uint32_t)(config->pitchBytes) << 16U);
                base->INPUT_STORE_SHIFT_CTRL_CH1 = shiftCtrlReg;
                base->INPUT_STORE_ADDR_0_CH1     = config->outputBaseAddr0;
                base->INPUT_STORE_ADDR_1_CH1     = config->outputBaseAddr1;
                dataShiftMaskRegAddr             = (uint32_t) & (base->INPUT_STORE_D_MASK0_H_CH0);
                dataShiftWidthRegAddr            = (uint32_t) & (base->INPUT_STORE_D_SHIFT_L_CH0);
                flagShiftMaskRegAddr             = (uint32_t) & (base->INPUT_STORE_F_MASK_L_CH0);
                flagShiftWidthRegAddr            = (uint32_t) & (base->INPUT_STORE_F_SHIFT_L_CH0);
                break;

            default:
                /* Only 2 channels are supported per fetch engine. */
                assert(false);
                break;
        }
    }
    else
    {
        switch (channel)
        {
            case 0:
                base->DITHER_STORE_CTRL_CH0 = ctrlReg;
                base->DITHER_STORE_SIZE_CH0 = sizeReg;
                base->DITHER_STORE_PITCH    = (base->DITHER_STORE_PITCH & PXP_DITHER_STORE_PITCH_CH0_OUT_PITCH_MASK) |
                                           (uint32_t)(config->pitchBytes);
                base->DITHER_STORE_SHIFT_CTRL_CH0 = shiftCtrlReg;
                base->DITHER_STORE_ADDR_0_CH0     = config->outputBaseAddr0;
                base->DITHER_STORE_ADDR_1_CH0     = config->outputBaseAddr1;
                base->DITHER_STORE_FILL_DATA_CH0  = config->fixedData;
                dataShiftMaskRegAddr              = (uint32_t) & (base->DITHER_STORE_D_MASK0_H_CH0);
                dataShiftWidthRegAddr             = (uint32_t) & (base->DITHER_STORE_D_SHIFT_L_CH0);
                flagShiftMaskRegAddr              = (uint32_t) & (base->DITHER_STORE_F_MASK_L_CH0);
                flagShiftWidthRegAddr             = (uint32_t) & (base->DITHER_STORE_F_SHIFT_L_CH0);
                break;

            case 1:
                base->DITHER_STORE_CTRL_CH1 = ctrlReg;
                base->DITHER_STORE_SIZE_CH1 = sizeReg;
                base->DITHER_STORE_PITCH    = (base->DITHER_STORE_PITCH & PXP_DITHER_STORE_PITCH_CH0_OUT_PITCH_MASK) |
                                           ((uint32_t)(config->pitchBytes) << 16U);
                base->DITHER_STORE_SHIFT_CTRL_CH1 = shiftCtrlReg;
                base->DITHER_STORE_ADDR_0_CH1     = config->outputBaseAddr0;
                base->DITHER_STORE_ADDR_1_CH1     = config->outputBaseAddr1;
                dataShiftMaskRegAddr              = (uint32_t) & (base->DITHER_STORE_D_MASK0_H_CH0);
                dataShiftWidthRegAddr             = (uint32_t) & (base->DITHER_STORE_D_SHIFT_L_CH0);
                flagShiftMaskRegAddr              = (uint32_t) & (base->DITHER_STORE_F_MASK_L_CH0);
                flagShiftWidthRegAddr             = (uint32_t) & (base->DITHER_STORE_F_SHIFT_L_CH0);
                break;

            default:
                /* Only 2 channels are supported per fetch engine. */
                assert(false);
                break;
        }
    }

    /* Shift configuration */
    if (!config->shiftConfig.shiftBypass)
    {
        uint8_t i;
        uint32_t dataShiftMaskAddr  = (uint32_t) & (config->shiftConfig.pDataShiftMask);
        uint32_t dataShiftWidthAddr = (uint32_t) & (config->shiftConfig.pDataShiftWidth);
        uint32_t flagShiftMaskAddr  = (uint32_t) & (config->shiftConfig.pFlagShiftMask);
        uint32_t flagShiftWidthAddr = (uint32_t) & (config->shiftConfig.pFlagShiftWidth);

        /* Configure data shift mask */
        for (i = 0U; i < 8U; i++)
        {
            *(uint32_t *)dataShiftMaskRegAddr = (uint32_t)(*(uint64_t *)dataShiftMaskAddr >> 32U);
            dataShiftMaskRegAddr += 0x10U;
            *(uint32_t *)dataShiftMaskRegAddr = (uint32_t)(*(uint64_t *)dataShiftMaskAddr);
            dataShiftMaskRegAddr += 0x10U;
            dataShiftMaskAddr += 8U;
        }

        /* Configure data shift width, flag shift mask/width */
        for (i = 0U; i < 8U; i++)
        {
            *(uint8_t *)dataShiftWidthRegAddr = *(uint8_t *)dataShiftWidthAddr;
            *(uint8_t *)flagShiftMaskRegAddr  = *(uint8_t *)flagShiftMaskAddr;
            *(uint8_t *)flagShiftWidthRegAddr = *(uint8_t *)flagShiftWidthAddr;
            dataShiftWidthRegAddr++;
            flagShiftMaskRegAddr++;
            flagShiftWidthRegAddr++;
            dataShiftWidthAddr++;
            flagShiftMaskAddr++;
            flagShiftWidthAddr++;
            if (i == 3U)
            {
                dataShiftWidthRegAddr += 12U;
                flagShiftMaskRegAddr += 12U;
                flagShiftWidthRegAddr += 12U;
            }
        }
    }

    return kStatus_Success;
}

/*!
 * brief Configures the pre-dither CFA engine.
 *
 * param base PXP peripheral base address.
 * param config pointer to the configuration structure.
 * retval kStatus_Success Successfully configured the engine.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t PXP_SetCfaConfig(PXP_Type *base, const pxp_cfa_config_t *config)
{
    assert(NULL != config);
    /* The CFA array cannot be larger than 15x15. */
    if ((config->arrayWidth > 15U) || (config->arrayHeight > 15U))
    {
        return kStatus_InvalidArgument;
    }

